# Droping Duplicates in Row Index

In [1]:
import pandas as pd

In [2]:
import warnings
warnings.filterwarnings("ignore")

In [4]:
data={
    "Name":["A","B","B","D","D","F"],
    "Age":[25,30,30,40,45,50],
    "City":["New york","Paris","Paris","Berlin","Paris","London"],
    "Salary":[50000,60000,70000,80000,90000,100000]
}
df=pd.DataFrame(data)
df

  Name  Age      City  Salary
0    A   25  New york   50000
1    B   30     Paris   60000
2    B   30     Paris   70000
3    D   40    Berlin   80000
4    D   45     Paris   90000
5    F   50    London  100000

In [6]:
df_duplicates=df.duplicated(keep="first")
df_duplicates

0    False
1    False
2    False
3    False
4    False
5    False
dtype: bool

In [9]:
df_duplicates=df.duplicated(keep="last")
df_duplicates

0    False
1    False
2    False
3    False
4    False
5    False
dtype: bool

In [7]:
df_duplicates=df.duplicated(keep=False)
df_duplicates

0    False
1    False
2    False
3    False
4    False
5    False
dtype: bool

## multidimenstional aggregation using pivot table()